/*หลักการเขียนเบื้องต้นของโปรแกรมภาษา C
#include <stdio.h> ใส่เพื่อเป็นการนำฟังก์ชันในกลุ่ม Standard Input/Ouput Function มาใช้
int main() ต้องมีการระบุ type
{
    คำสั่งที่ให้แสดงผลบนหน้าจอ
    putsจะต่างจากprintตรงที่มันมีputsจะแสดงผลข้อมูลออกมาแล้วขึ้นบรรทัดใหม่
    printf(); ต้องมี;ก่อนขึ้นบรรทัดใหม่
    puts(); 
}
    เครื่องหมายคอมเม้นต์
    /*สิ่งที่ต้องการคอมเม้นต์อยู่ข้างใน*/
    //สิ่งที่ต้องการคอมเม้นต์อยู่ด้านหลัง
//example
int main()
{
    printf("Hello world.");
    puts("Hello");
    puts("World.");
    printf("%d",2);
}
/*จะได้
็Hello world.Hello
World
2*/